Revit 2024 API
ToggleButtonData Constructor (String, String)
Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ToggleButtonData(
	string name,
	string text
)
Visual Basic
Public Sub New ( _
	name As String, _
	text As String _
)
Visual C++
public:
ToggleButtonData(
	String^ name,
	String^ text
)
Parameters
name
Type: System.String
The internal name of the new button.
text
Type: System.String
The user visible text seen on the new button.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException | Thrown when null is passed for one or more arguments.
Autodesk.Revit.Exceptions.ArgumentException | Thrown when an empty string is passed for one or more arguments.
See Also
ToggleButtonData Class
ToggleButtonData Overload
Autodesk.Revit.UI Namespace